In [1]:
import numpy as np
a = np.array([[1,2], [3, 4], [5, 6]])
print(a[a>2])

[3 4 5 6]

In [2]:
import pandas as pd
df = pd.read_csv('wiki2top100.tsv', sep='\t')

In [9]:
print(df.shape)
print(df.iloc[:, 0])
# print(df.iloc[0])

(58541, 2)
0                                               Cam_Newton
1        Republican_Conference_of_the_United_States_Hou...
2                                              Ben_Ainslie
3                                                 Actelion
4                                           Organic_growth
                               ...
58536                                 Herpes_simplex_virus
58537                                              Oarfish
58538                               Starwood_Capital_Group
58539                     The_Walking_Dead_%28TV_series%29
58540                        Order_of_Prince_Edward_Island
Name: Mark_Giordano, Length: 58541, dtype: object

In [11]:
import pandas as pd
import numpy as np
df = pd.read_csv('sample_data.csv', index_col=0)
df

          state  color    food  age  height  score
Jane         NY   blue   Steak   30     165    4.6
Niko         TX  green    Lamb    2      70    8.3
Aaron        FL    red   Mango   12     120    9.0
Penelope     AL  white   Apple    4      80    3.3
Dean         AK   gray  Cheese   32     180    1.8
Christina    TX  black   Melon   33     172    9.5
Cornelia     TX    red   Beans   69     150    2.2

In [14]:
index = df.index
columns = df.columns
values = df.values
print(index)
print(columns)
print(values)

Index(['Jane', 'Niko', 'Aaron', 'Penelope', 'Dean', 'Christina', 'Cornelia'], dtype='object')
Index(['state', 'color', 'food', 'age', 'height', 'score'], dtype='object')
[['NY' 'blue' 'Steak' 30 165 4.6]
 ['TX' 'green' 'Lamb' 2 70 8.3]
 ['FL' 'red' 'Mango' 12 120 9.0]
 ['AL' 'white' 'Apple' 4 80 3.3]
 ['AK' 'gray' 'Cheese' 32 180 1.8]
 ['TX' 'black' 'Melon' 33 172 9.5]
 ['TX' 'red' 'Beans' 69 150 2.2]]

### Data types of the components

In [16]:
type(index)

pandas.core.indexes.base.Index

In [17]:
type(columns)

pandas.core.indexes.base.Index

In [18]:
type(values)

numpy.ndarray

### Selecting a single column as a Series

In [20]:
df['food']

Jane          Steak
Niko           Lamb
Aaron         Mango
Penelope      Apple
Dean         Cheese
Christina     Melon
Cornelia      Beans
Name: food, dtype: object

### Series

Selecting a single column of data returns the other pandas data container, the Series. A Series is a one-dimensional sequence of labeled data. There are two main components of a Series, the index and the data(or values). There are NO columns in a Series.

### Selecting multiple columns with just the indexing operator

In [24]:
df[['color', 'food', 'score']]

           color    food  score
Jane        blue   Steak    4.6
Niko       green    Lamb    8.3
Aaron        red   Mango    9.0
Penelope   white   Apple    3.3
Dean        gray  Cheese    1.8
Christina  black   Melon    9.5
Cornelia     red   Beans    2.2

#### Selecting multiple columns returns a DataFrame

In [25]:
df[['food']]

             food
Jane        Steak
Niko         Lamb
Aaron       Mango
Penelope    Apple
Dean       Cheese
Christina   Melon
Cornelia    Beans

### indexing操作总结
1. indexing的主要作用就是按列名选列
2. 选一列返回 Series
3. 选多列返回 DataFrame
4. 也可以用index选行，与选列类似

### 用 .loc 选行

In [30]:
df.loc['Niko']

state        TX
color     green
food       Lamb
age           2
height       70
score       8.3
Name: Niko, dtype: object

In [28]:
df['food']

Jane          Steak
Niko           Lamb
Aaron         Mango
Penelope      Apple
Dean         Cheese
Christina     Melon
Cornelia      Beans
Name: food, dtype: object

### 多选

In [32]:
df.loc[['Niko', 'Penelope']]

         state  color   food  age  height  score
Niko        TX  green   Lamb    2      70    8.3
Penelope    AL  white  Apple    4      80    3.3

### 范围多选

注意:.loc includes the last value with slice notation

In [33]:
df.loc['Niko':'Dean']

         state  color    food  age  height  score
Niko        TX  green    Lamb    2      70    8.3
Aaron       FL    red   Mango   12     120    9.0
Penelope    AL  white   Apple    4      80    3.3
Dean        AK   gray  Cheese   32     180    1.8

### 用 .loc 同时按列，按行选

df.loc[row_selection, column_selection]

In [34]:
df.loc[['Dean', 'Cornelia'], ['age', 'state', 'score']]

          age state  score
Dean       32    AK    1.8
Cornelia   69    TX    2.2

### 其实用 .loc 可以任意组合  单选，多选，范围选

In [36]:
df.loc[['Dean', 'Aaron'], 'food']

Dean     Cheese
Aaron     Mango
Name: food, dtype: object

In [37]:
df.loc['Jane':'Penelope', ['state', 'color']]

         state  color
Jane        NY   blue
Niko        TX  green
Aaron       FL    red
Penelope    AL  white

In [38]:
df.loc['Jane', 'age']

30

In [39]:
df.loc[:, ['food', 'color']]

             food  color
Jane        Steak   blue
Niko         Lamb  green
Aaron       Mango    red
Penelope    Apple  white
Dean       Cheese   gray
Christina   Melon  black
Cornelia    Beans    red

### .iloc
The .iloc indexer is very similar to .loc but only uses integer locations to make its selections.

In [40]:
df.iloc[3]

state        AL
color     white
food      Apple
age           4
height       80
score       3.3
Name: Penelope, dtype: object

#### .iloc 多选

In [41]:
df.iloc[[5, 2, 4]]       # remember, don't do df.iloc[5, 2, 4]

          state  color    food  age  height  score
Christina    TX  black   Melon   33     172    9.5
Aaron        FL    red   Mango   12     120    9.0
Dean         AK   gray  Cheese   32     180    1.8

In [43]:
df.iloc[3:5]

         state  color    food  age  height  score
Penelope    AL  white   Apple    4      80    3.3
Dean        AK   gray  Cheese   32     180    1.8

In [44]:
df.iloc[3::2]

          state  color   food  age  height  score
Penelope     AL  white  Apple    4      80    3.3
Christina    TX  black  Melon   33     172    9.5

In [45]:
df.iloc[[2,3], [0, 4]]

         state  height
Aaron       FL     120
Penelope    AL      80

### 和 python 原生list 和 dictionary的比较

1. python list: 可以用 integer index 和slicing 选择，但是不能用list of integers
2. python dictionary: 可以用 label key 选择，但是不能用 int index 和 slicing

In [50]:
some_list = ['a', 'two', 10, 4, 0, 'asdf', 'mgmt', 434, 99]

In [51]:
some_list[5]

'asdf'

In [52]:
some_list[-1]

99

In [53]:
some_list[:4]

['a', 'two', 10, 4]

In [54]:
some_list[2:6:3]

[10, 'asdf']